views/order/admin.php

SELECT * FROM `category_has_merchant` WHERE (`is_active`=1) AND (`merchant_id`=2) AND (`is_group`=0)
---



        $cats_merch = \common\models\CategoryHasMerchant::find()->where(['is_active' => 1, 'merchant_id' => Yii::$app->user->id, 'is_group' => 0])->all();

SELECT * FROM `staff` WHERE `id`=12
SELECT * FROM `staff` WHERE `merchant_id`=2
---
                    }
                ),

				array(
                    'label' => Yii::t('basicfield', 'Staff'),
                    'attribute' => 'staff_id',
                    'filter' => yii\helpers\ArrayHelper::map(common\models\Staff::find()->where(['merchant_id' => Yii::$app->user->id])->all(), 'id', 'name'),
                    'value' => function($model){
                        return $model->staff->name;
                    }
                ),