components/DashboardHelper.php

SELECT COUNT(*) FROM `staff` WHERE `merchant_id`=2
---
    public static function getCountStaff()
    {
        return \common\models\Staff::find()->where(['merchant_id' => Yii::$app->user->id])->count();

SELECT count(*) as total FROM `order` where create_time>="2017-02-28 10:30:24" and merchant_id=2 and status !=2 and is_service_gift=0
---
    public static function getOrdersThisMonth()
    {
        $crit = new CDbCriteria();
        $crit->condition = 'merchant_id=' . Yii::app()->user->id;
        $crit->addCondition('create_time>="' . date('Y-m-01 00:00:00') . '"');

        return Order::model()->count($crit);

SELECT COUNT(*) FROM `category_has_merchant` WHERE `merchant_id`=2
---
    public static function getCountServicesOfMerchant()
    {
        return \common\models\CategoryHasMerchant::find()->where(['merchant_id' => Yii::$app->user->id])->count();

SELECT COUNT(*) FROM (SELECT DISTINCT `category_id` FROM `category_has_merchant` WHERE `merchant_id`=2) `c`
---
    public static function getCountCategoriesOfMerchant()
    {
//        $crit = new CDbCriteria();
//        $crit->select = 'category_id';
//        $crit->distinct = true;
//        $crit->condition = 'merchant_id=' . Yii::app()->user->id;

        return \common\models\CategoryHasMerchant::find()
                ->select('category_id')
                ->where(['merchant_id' => Yii::$app->user->id])
                ->distinct(true)
                ->count();

SELECT ceil(AVG(rating)) as total FROM `mt_review` where merchant_id=2
SELECT COUNT(*) FROM `mt_review` WHERE `merchant_id`=2
---
    public static function getCountReview()
    {
        return \common\models\Review::find()->where(['merchant_id' => Yii::$app->user->id])->count();

SELECT * FROM `mt_merchant` WHERE `merchant_id`=2
---
    public static function getDataForGraph($sales)
    {
        $merchnat = \common\models\Merchant::findOne(['merchant_id' => Yii::$app->user->id]);

SELECT COUNT(id) as count_by_date, DATE(order_time) as date_of_order, DATE(create_time) as create_time FROM `order` WHERE merchant_id=2 and ( create_time between "2016-03-01 00:00:00" and "2017-03-31") and is_service_gift=0 GROUP BY YEAR(create_time), MONTH(create_time) ORDER BY `order_time`
---
//


        $models = \common\models\Order::find()
                ->select('COUNT(id) as count_by_date, DATE(order_time) as date_of_order, DATE(create_time) as create_time')
                ->where('merchant_id=' . Yii::$app->user->id. ' and ( create_time between "'.$fromMonth.'" and "'.$ToMonth.'") and is_service_gift=0')
                ->groupBy('YEAR(create_time), MONTH(create_time)')
                ->orderBy('order_time')
                ->all();

SELECT * FROM `order` WHERE (`merchant_id`=2) AND (`is_service_gift`=0) ORDER BY `id` DESC LIMIT 7
---
    public static function getLatestOrders()
    {
//        $crit = new CDbCriteria();
//        $crit->order = 'id DESC';
//        $crit->limit = '7';
//        $crit->condition = 'merchant_id=' . Yii::app()->user->id;

        $orders = \common\models\Order::find()
                ->where(['merchant_id' => Yii::$app->user->id, 'is_service_gift'=> 0])
                ->orderBy('id desc')
                ->limit(7)
                ->all();

SELECT * FROM `category_has_merchant` WHERE `merchant_id`=2 ORDER BY `id` DESC LIMIT 4
---
    public static function getLastServices()
    {


        $categoryHasmerchant = \common\models\CategoryHasMerchant::find()
                ->where(['merchant_id' => Yii::$app->user->id])
                ->orderBy('id DESC')
                ->limit(4)
                ->all();